# * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей. Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара: название, цена, количество, единица измерения). Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
#Пример готовой структуры:
#[
#(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
#(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
#(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
#]
#Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара, например название, а значение — список значений-характеристик, например список названий товаров.
#Пример:
#{
#“название”: [“компьютер”, “принтер”, “сканер”],
#“цена”: [20000, 6000, 2000],
#“количество”: [5, 2, 7],
#“ед”: [“шт.”]
#}

goods = []
feature = {"name": "", "price": "", "quantity" : "", "unit" : ""}
analytics = {"name": [], "price": [], "quantity" : [], "unit" : []}
num = 0
while True:
    if input("Press Q to exit or Enter to continue: ").upper() == "Q":
        break
    num += 1
    feature = feature.copy()
    for f in feature:
        pro = input(f"Enter options {f}:")
        feature[f] = int(pro) if f == "price" or f == "quantity" else pro
        analytics[f].append(feature[f])
    goods.append((num, feature))
    print(f" \nItem option\n {goods}")
    print(f'Analitic {"*" * 30 }')
    for key, value in analytics.items():
        print(f"{key:>30}: {value}")
    print("*" * 30)
