#Поработайте с переменными, создайте несколько, выведите на экран.
#Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.
i = "str"
o = 6
s = 6.7
q = True
print(i)
print(o)
print(s)
print(f"{q}, {i}")
number1 = int(input("Введите число :"))
number2 = int(input("Введите ещё одно число :"))
name = input("Введите свое Имя:")
year = int(input("Введите год своего рождения :"))
age = 2021 - year
print(f"Вы ввели число {number1} и число {number2}")
print(f" Вас зовут {name} и Вам наверно {age}")
#Все